INSERT INTO AdditionalConditions (id, property_ownership, has_children, no_bad_habits) 
VALUES 
(1, true, false, true),
(2, false, true, false),
(3, true, true, true),
(4, false, false, true),
(5, true, false, false),
(6, false, true, true),
(7, true, true, false),
(8, false, false, false),
(9, true, false, true),
(10, false, true, false),
(11, true, true, true),
(12, false, false, true),
(13, true, false, false),
(14, false, true, true),
(15, true, true, false),
(16, false, false, false),
(17, true, false, true),
(18, false, true, false),
(19, true, true, true),
(20, false, false, true);

INSERT INTO PartnerRequirements 
(id, education, nationality, min_age, max_age, salary, additional_conditions_id) 
VALUES 
(1, 'Высшее', 'Русский', 25, 35, 80000, 1),
(2, 'Среднее', 'Русская', 20, 30, 50000,2),
(3, 'Высшее', 'Украинец', 22, 40, 70000, 13),
(4, 'Средне-профессиональное', 'Русский', 18, 20, 60000, 4),
(5, 'Высшее', 'Русская', 23, 28, 75000, 5),
(6, 'Среднее', 'Украинец', 21, 35, 55000, 6),
(7, 'Высшее', 'Русский', 26, 32, 85000, 7),
(8, 'Среднее', 'Русская', 19, 25, 48000, 8),
(9, 'Высшее', 'Украинец', 24, 38, 72000, 9),
(10, 'Средне-профессиональное', 'Русский', 20, 29, 58000, 10),
(11, 'Высшее', 'Русская', 27, 33, 78000, 11),
(12, 'Среднее', 'Украинец', 22, 36, 60000, 12),
(13, 'Высшее', 'Русский', 28, 34, 82000, 13),
(14, 'Среднее', 'Русская', 21, 27, 52000, 14),
(15, 'Высшее', 'Украинец', 25, 39, 74000, 15),
(16,'Средне-профессиональное','Русский',19 ,22 ,62000 ,16),
(17,'Высшее','Русская',24 ,29 ,76000 ,17),
(18,'Среднее','Украинец',23 ,37 ,58000 ,18),
(19,'Высшее','Русский',29 ,35 ,82000 ,19),
(20,'Среднее','Русская',22 ,28 ,54000 ,20);




INSERT INTO Clients (id, last_name, first_name, middle_name, age, nationality, education, salary, additional_conditions_id, partner_requirements_id) 
VALUES 
(1, 'Иванов' ,'Иван','Иванович',25,'Русский','Высшее', 60000, 1, 1),
(2, 'Петров', 'Петр', 'Петрович', 30, 'Украинец', 'Среднее', 35000, 2, 2),
(3, 'Сидоров', 'Алексей', 'Алексеевич', 28, 'Русский', 'Высшее', 70000, 3, 3),
(4, 'Смирнова', 'Елена', 'Владимировна', 22, 'Русская', 'Средне-профессиональное', 45000, 4, 4),
(5, 'Козлов', 'Дмитрий', 'Андреевич', 32, 'Русский', 'Высшее', 80000, 5, 5),
(6, 'Новикова', 'Ольга', 'Сергеевна', 27, 'Русская', 'Среднее', 40000, 6, 6),
(7, 'Морозов', 'Антон', 'Игоревич', 29, 'Русский', 'Высшее', 65000, 7, 7),
(8, 'Кузнецова', 'Мария', 'Александровна', 24, 'Русская', 'Средне-профессиональное', 50000, 8, 8),
(9, 'Васильева', 'Екатерина', 'Михайловна', 26, 'Русская', 'Высшее', 75000, 9, 9),
(10, 'Федоров', 'Артем', 'Владимирович', 31, 'Русский', 'Среднее', 42000, 10, 10),
(11, 'Белякова', 'Наталья', 'Сергеевна', 23, 'Русская', 'Высшее', 68000, 11, 11),
(12, 'Григорьева', 'Анна', 'Ивановна', 33, 'Русская', 'Средне-профессиональное', 48000, 12, 12),
(13, 'Калинина', 'Татьяна', 'Александровна', 20, 'Русская', 'Высшее', 70000, 13, 13),
(14, 'Павлова', 'Вера', 'Дмитриевна', 35, 'Русская', 'Среднее', 55000, 14, 14),
(15, 'Максимова', 'Елена', 'Анатольевна', 28, 'Русская', 'Высшее', 80000, 15, 15),
(16, 'Соколова', 'Ольга', 'Игоревна', 25, 'Русская', 'Средне-профессиональное', 45000, 16, 16),
(17, 'Дмитриева', 'Мария', 'Алексеевна', 30, 'Русская', 'Высшее', 75000, 17, 17),
(18, 'Кузьмина', 'Екатерина', 'Ивановна', 27, 'Русская', 'Среднее', 50000, 18, 18),
(19, 'Тарасова', 'Наталья','Михайловна' ,26 , 'Русская' , 'Высшее' ,65000 ,19 ,19 ),
(20,'Сергеева' ,'Анна' ,'Владимировна' ,29 , 'Русская' ,'Средне-профессиональное' ,70000 ,20 ,20 );


